export const questions = [
    {
        id: 1,
        question: "Եթե 3 կատու բռնում են 3 մուկ 3 րոպեում, ապա 100 կատու քանի րոպեում կբռնի 100 մուկ?",
        options: [
            "3 րոպե",
            "100 րոպե",
            "1 րոպե",
            "30 րոպե"
        ],
        correctAnswer: 0
    },
    {
        id: 2,
        question: "Որ թիվն է հաջորդը՝ 2, 4, 8, 16, ?",
        options: [
            "18",
            "24",
            "32",
            "20"
        ],
        correctAnswer: 2
    },
    {
        id: 3,
        question: "Եթե բոլոր A-ները B են, և բոլոր B-ները C են, ապա՝",
        options: [
            "Բոլոր A-ները C են",
            "Ոչ մի A C չէ",
            "Միայն որոշ A-ներ են C",
            "Չի կարելի որոշել"
        ],
        correctAnswer: 0
    },
    {
        id: 4,
        question: "Դու ունես 2 դուռ․ մեկը տանում է ազատության, մյուսը՝ վտանգի։ Երկու պահակներից մեկը միշտ ասում է ճշմարտությունը, մյուսը՝ ստում։ Ինչ հարց կտաս, որպեսզի գտնես ճիշտ դուռը?",
        options: [
            "Ո՞ր դուռն է ճիշտ",
            "Ի՞նչ կասի մյուս պահակը ճիշտ դռան մասին",
            "Դու ստո՞ւմ ես",
            "Ո՞րն է ձախ դուռը"
        ],
        correctAnswer: 1
    },
    {
        id: 5,
        question: "Եթե այսօր երկուշաբթի է, ապա 100 օր հետո ի՞նչ օր կլինի",
        options: [
            "Չորեքշաբթի",
            "Երկուշաբթի",
            "Ուրբաթ",
            "Կիրակի"
        ],
        correctAnswer: 0
    },
    {
        id: 6,
        question: "Ի՞նչ կպատահի, եթե ռոբոտին ասեք. «Քայլիր ուղիղ, մինչև հանդիպես պատի, հետո շրջվիր և նորից քայլիր ուղիղ»:",
        options: [
            "Նա կանջատվի",
            "Նա կհոգնի ու կնստի",
            "Նա կջարդի պատը",
            "Նա կքայլի հավերժ (առաջ-հետ)"
        ],
        correctAnswer: 3
    },
    {
        id: 7,
        question: "Եթե 5 մեքենա 5 րոպեում արտադրում է 5 մաս, ապա 100 մեքենա 100 մաս արտադրելու համար քանի րոպե կպահանջվի",
        options: [
            "5 րոպե",
            "100 րոպե",
            "20 րոպե",
            "1 րոպե"
        ],
        correctAnswer: 0
    },
    {
        id: 8,
        question: "Ո՞րն է հաջորդը՝ 1, 1, 2, 3, 5, 8, ?",
        options: [
            "11",
            "13",
            "10",
            "15"
        ],
        correctAnswer: 1
    },
    {
        id: 9,
        question: "Եթե մի ծրագրավորողը 1 օրում գրում է 10 տող կոդ, ապա 10 ծրագրավորողը 1 օրում քանի տող կգրի",
        options: [
            "10",
            "100",
            "50",
            "1000"
        ],
        correctAnswer: 1
    },
    {
        id: 10,
        question: "Դիտարկիր հետևյալ հաջորդականությունը․ 2, 6, 12, 20, 30, ? Ո՞ր թիվը պետք է լինի հաջորդը",
        options: [
            "40",
            "41",
            "42",
            "44"
        ],
        correctAnswer: 2
    }
]

export const totalQuestions = questions.length